Revit 2024 API
MacroModule.ModuleStatus Property
 The module status.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ModuleStatus ModuleStatus { get; }
Visual Basic
Public ReadOnly Property ModuleStatus As ModuleStatus
	Get
Visual C++
public:
property ModuleStatus ModuleStatus {
	ModuleStatus get ();
}
See Also
MacroModule Class
Autodesk.Revit.DB.Macros Namespace